Repository: lifanwar/my-base-django
Catalog: locale/*/LC_MESSAGES/django.po
Languages: id

source: Automated blacklist alert system for Indonesian students in Egypt. Telegram bot with location-based search and Django Admin dashboard with Leaflet map integration.
id: Sistem peringatan blacklist otomatis untuk mahasiswa Indonesia di Mesir. Bot Telegram dengan pencarian berbasis lokasi dan dashboard Django Admin dengan integrasi peta Leaflet.

source: Automation Projects
id: Proyek Otomasi

source: Specialized in building automation solutions for Telegram and WhatsApp that help businesses streamline operations and improve customer engagement.
id: Berspesialisasi dalam membangun solusi otomasi untuk Telegram dan WhatsApp yang membantu bisnis menyederhanakan operasi dan meningkatkan keterlibatan pelanggan.

source: Reusable framework for rapid Telegram bot development with built-in user management, payment processing, and webhook integration.
id: Framework yang dapat digunakan kembali untuk pengembangan bot Telegram cepat dengan manajemen pengguna bawaan, pemrosesan pembayaran, dan integrasi webhook.

source: Smart auto-responder system with keyword detection, scheduled messages, and multi-agent support. Handles 50K+ messages monthly.
id: Sistem auto-responder cerdas dengan deteksi kata kunci, pesan terjadwal, dan dukungan multi-agen. Menangani 50K+ pesan per bulan.

source: Unified system for managing campaigns across Website, Telegram and WhatsApp with broadcast messaging and analytics tracking.
id: Sistem terpadu untuk mengelola kampanye di Website, Telegram, dan WhatsApp dengan pesan siaran dan pelacakan analitik.

source: Let's Work Together
id: Mari Bekerja Sama

source: I'm always interested in hearing about new projects and opportunities. Whether you need a full stack developer or automation specialist, feel free to reach out.
id: Saya selalu tertarik mendengar tentang proyek dan peluang baru. Baik Anda membutuhkan full stack developer atau spesialis automasi, jangan ragu untuk menghubungi saya.

source: Phone
id: Telepon

source: Location
id: Lokasi

source: Cairo, Egypt
id: Kairo, Mesir

source: Connect
id: Hubungi

source: Full Stack Developer specializing in web applications and automation solutions.
id: Full Stack Developer yang berspesialisasi dalam aplikasi web dan solusi otomasi.

source: Quick Links
id: Tautan Cepat

source: About
id: Tentang

source: Projects
id: Proyek

source: Contact
id: Kontak

source: © 2026 Mualiful Anwar. All rights reserved.
id: © 2026 Mualiful Anwar. Hak cipta dilindungi undang-undang.

source: Back to Portfolio
id: Kembali ke Portfolio
